cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF51xR.xml
        <!-- REGISTER "ADST1" -->
        <register>
          <name>ADST1</name>
          <description>Sampling Time Setup Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description>Sampling time N times setting bits</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST1" -->
            <field>
              <name>ST1</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST0" -->
        <register>
          <name>ADST0</name>
          <description>Sampling Time Setup Register 0</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description>Sampling time N times setting bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST0" -->
            <field>
              <name>ST0</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description>Comparison Time Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description>Compare clock frequency division ratio setting bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description>Priority Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description>Priority conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCTSL" -->
        <register>
          <name>SCTSL</name>
          <description>Scan Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCTSL" -->
            <field>
              <name>SCTSL</name>
              <description>Scan conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCEN" -->
        <register>
          <name>ADCEN</name>
          <description>A/D Operation Enable Setup Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CYCLSL" -->
            <field>
              <name>CYCLSL</name>
              <description>Basic cycle selection bit </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "READY" -->
            <field>
              <name>READY</name>
              <description>A/D operation enable state bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ENBL" -->
            <field>
              <name>ENBL</name>
              <description>A/D operation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ADC1" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40027100</baseAddress>
      <!-- INTERRUPT "ADC1" -->
      <interrupt>
        <name>ADC1</name>
        <value>26</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "ADC2" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40027200</baseAddress>
      <!-- INTERRUPT "ADC2" -->
      <interrupt>
        <name>ADC2</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "EXTI" -->
    <peripheral>
      <name>EXTI</name>
      <description>External Interrupt and NMI Control</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40030000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTINT0_7" -->
      <interrupt>
        <name>EXTINT0_7</name>
        <value>4</value>
      </interrupt>
      <!-- INTERRUPT "EXTINT8_15" -->
      <interrupt>
        <name>EXTINT8_15</name>
        <value>5</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ENIR" -->
        <register>
          <name>ENIR</name>
          <description>Enable Interrupt Request Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN15" -->
            <field>
              <name>EN15</name>
              <description>Bit15 of ENIR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN14" -->
            <field>
              <name>EN14</name>
              <description>Bit14 of ENIR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN13" -->
            <field>
              <name>EN13</name>
              <description>Bit13 of ENIR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN12" -->
            <field>
              <name>EN12</name>
              <description>Bit12 of ENIR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN11" -->
            <field>
              <name>EN11</name>
              <description>Bit11 of ENIR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN10" -->
            <field>
              <name>EN10</name>
              <description>Bit10 of ENIR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN9" -->
            <field>
              <name>EN9</name>
              <description>Bit9 of ENIR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN8" -->
            <field>
              <name>EN8</name>
              <description>Bit8 of ENIR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN7" -->
            <field>
              <name>EN7</name>
              <description>Bit7 of ENIR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN6" -->
            <field>
              <name>EN6</name>
              <description>Bit6 of ENIR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN5" -->
            <field>
              <name>EN5</name>
              <description>Bit5 of ENIR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN4" -->
            <field>
              <name>EN4</name>
              <description>Bit4 of ENIR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN3" -->
            <field>
              <name>EN3</name>
              <description>Bit3 of ENIR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN2" -->
            <field>
              <name>EN2</name>
              <description>Bit2 of ENIR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN1" -->
            <field>
              <name>EN1</name>
              <description>Bit1 of ENIR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN0" -->
            <field>
              <name>EN0</name>
              <description>Bit0 of ENIR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EIRR" -->
        <register>
          <name>EIRR</name>
          <description>External Interrupt Request Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ER15" -->
            <field>
              <name>ER15</name>
              <description>Bit15 of EIRR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER14" -->
            <field>
              <name>ER14</name>
              <description>Bit14 of EIRR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER13" -->
            <field>
              <name>ER13</name>
              <description>Bit13 of EIRR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER12" -->
            <field>
              <name>ER12</name>
              <description>Bit12 of EIRR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER11" -->
            <field>
              <name>ER11</name>
              <description>Bit11 of EIRR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER10" -->
            <field>
              <name>ER10</name>
              <description>Bit10 of EIRR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER9" -->
            <field>
              <name>ER9</name>
              <description>Bit9 of EIRR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER8" -->
            <field>
              <name>ER8</name>
              <description>Bit8 of EIRR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER7" -->
            <field>
              <name>ER7</name>
              <description>Bit7 of EIRR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER6" -->
            <field>
              <name>ER6</name>
              <description>Bit6 of EIRR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER5" -->
            <field>
              <name>ER5</name>
              <description>Bit5 of EIRR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER4" -->
            <field>
              <name>ER4</name>
              <description>Bit4 of EIRR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER3" -->
            <field>
              <name>ER3</name>
              <description>Bit3 of EIRR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER2" -->
            <field>
              <name>ER2</name>
              <description>Bit2 of EIRR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER1" -->
            <field>
              <name>ER1</name>
              <description>Bit1 of EIRR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER0" -->
            <field>
              <name>ER0</name>
              <description>Bit0 of EIRR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EICL" -->
        <register>
          <name>EICL</name>
          <description>External Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECL15" -->
            <field>
              <name>ECL15</name>
              <description>Bit15 of EICL</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL14" -->
            <field>
              <name>ECL14</name>
              <description>Bit14 of EICL</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL13" -->
            <field>
              <name>ECL13</name>
              <description>Bit13 of EICL</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL12" -->
            <field>
              <name>ECL12</name>
              <description>Bit12 of EICL</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL11" -->
            <field>
              <name>ECL11</name>
              <description>Bit11 of EICL</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL10" -->
            <field>
              <name>ECL10</name>
              <description>Bit10 of EICL</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL9" -->
            <field>
              <name>ECL9</name>
              <description>Bit9 of EICL</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL8" -->
            <field>
              <name>ECL8</name>
              <description>Bit8 of EICL</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL7" -->
            <field>
              <name>ECL7</name>
              <description>Bit7 of EICL</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL6" -->
            <field>
              <name>ECL6</name>
              <description>Bit6 of EICL</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL5" -->
            <field>
              <name>ECL5</name>
              <description>Bit5 of EICL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL4" -->
            <field>
              <name>ECL4</name>
              <description>Bit4 of EICL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL3" -->
            <field>
              <name>ECL3</name>
              <description>Bit3 of EICL</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL2" -->
            <field>
              <name>ECL2</name>
              <description>Bit2 of EICL</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL1" -->
            <field>
              <name>ECL1</name>
              <description>Bit1 of EICL</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL0" -->
            <field>
              <name>ECL0</name>
              <description>Bit0 of EICL</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
